bitmorse/LilyGo_Txx/T10_V20_1C8_ESP-IDF/sdkconfig.defaults
# Board-specific defaults for the LilyGO TTGO T10 V2.0 (ESP32).
# These are applied automatically on the first build; edit with `make menuconfig`.

CONFIG_IDF_TARGET="esp32"

# 4 MB flash, DIO mode (matches the factory Arduino settings for this board)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# The T10/TS boards do NOT have usable PSRAM -> leave SPIRAM disabled (default).

# A little extra stack for app_main (display + wifi work happens here).
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# Serial console @ 115200 (what `make monitor` expects).
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# --- LVGL 9 configuration (Kconfig-driven; no manual lv_conf.h) -------------
CONFIG_LV_CONF_SKIP=n
CONFIG_LV_COLOR_DEPTH_16=y
# ST7735 wants big-endian RGB565; we byte-swap in the flush callback instead of
# here, so leave LV_COLOR_16_SWAP off.
CONFIG_LV_USE_MENU=y
CONFIG_LV_USE_SPINBOX=y
CONFIG_LV_USE_DROPDOWN=y
CONFIG_LV_USE_SWITCH=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_LIST=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
# Heap for LVGL objects. 48 KB is plenty for this small UI.
CONFIG_LV_USE_STDLIB_MALLOC_BUILTIN=y
CONFIG_LV_MEM_SIZE_KILOBYTES=48
# We drive lv_tick via esp_timer (lv_tick_set_cb), so no built-in tick.
CONFIG_LV_USE_LOG=n
